dangdangduong2k2/esp32c5-ms51-icp/main/ms51_debug_uart.c
#include "ms51_debug_uart.h"

#include <ctype.h>
#include <string.h>

#include "driver/gpio.h"
#include "driver/uart.h"
#include "esp_log.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "freertos/task.h"
#include "sdkconfig.h"

static const char *TAG = "ms51_debug_uart";

#define MS51_DEBUG_UART_PORT UART_NUM_1
#define MS51_DEBUG_RX_BUFFER_SIZE 1024u
#define MS51_DEBUG_TX_BUFFER_SIZE 512u
#define MS51_DEBUG_READ_BUFFER_SIZE 64u
#define MS51_DEBUG_LINE_SIZE 128u
#define MS51_DEBUG_TASK_STACK_SIZE 3072u
#define MS51_DEBUG_TASK_PRIORITY 4u
#define MS51_DEBUG_READ_WAIT_MS 25u

#define MS51_RUNTIME_REQUEST_SOF 0xA5u
#define MS51_RUNTIME_RESPONSE_SOF 0xA6u
#define MS51_RUNTIME_COMMAND_GET 0x47u
#define MS51_RUNTIME_COMMAND_SET 0x53u
#define MS51_RUNTIME_REQUEST_MAX_SIZE (1u + 1u + 1u + 1u + MS51_RUNTIME_CONFIG_SIZE + 2u)
#define MS51_RUNTIME_RESPONSE_TIMEOUT_MS 3000u

#if CONFIG_MS51_DEBUG_UART_ENABLE
#define MS51_DEBUG_UART_ENABLED true
#define MS51_DEBUG_UART_BAUD_RATE CONFIG_MS51_DEBUG_UART_BAUD
#else
#define MS51_DEBUG_UART_ENABLED false
#define MS51_DEBUG_UART_BAUD_RATE 115200
#endif

typedef enum {
    MS51_RUNTIME_RX_WAIT_SOF = 0,
    MS51_RUNTIME_RX_COMMAND,
    MS51_RUNTIME_RX_SEQUENCE,
    MS51_RUNTIME_RX_STATUS,
    MS51_RUNTIME_RX_LENGTH,
    MS51_RUNTIME_RX_PAYLOAD,
    MS51_RUNTIME_RX_CRC_HIGH,
    MS51_RUNTIME_RX_CRC_LOW,
} ms51_runtime_rx_state_t;

typedef struct {
    SemaphoreHandle_t mutex;
    SemaphoreHandle_t command_mutex;
    SemaphoreHandle_t response_semaphore;
    TaskHandle_t task;
    bool initialized;
    bool enabled;
    bool receiver_attached;
    bool paused_for_icp;
    uint32_t baud_rate;
    uint32_t bytes_received;
    uint32_t lines_received;
    uint32_t dropped_lines;
    uint64_t last_rx_us;
    char line[MS51_DEBUG_LINE_SIZE];
    size_t line_length;
    bool line_overflow;
    ms51_debug_variable_t variables[MS51_DEBUG_MAX_VARIABLES];
    ms51_debug_log_line_t logs[MS51_DEBUG_MAX_LOG_LINES];
    size_t log_count;
    size_t next_log;

    ms51_runtime_rx_state_t runtime_rx_state;
    uint8_t runtime_rx_command;
    uint8_t runtime_rx_sequence;
    uint8_t runtime_rx_status;
    uint8_t runtime_rx_length;
    uint8_t runtime_rx_index;
    uint16_t runtime_rx_crc;
    uint16_t runtime_rx_received_crc;
    uint8_t runtime_rx_payload[MS51_RUNTIME_CONFIG_SIZE];

    bool runtime_waiting;
    uint8_t runtime_expected_command;
    uint8_t runtime_expected_sequence;
    bool runtime_response_ready;
    uint8_t runtime_response_status;
    size_t runtime_response_length;
    uint8_t runtime_response[MS51_RUNTIME_CONFIG_SIZE];
    uint8_t next_runtime_sequence;
} ms51_debug_uart_state_t;

static ms51_debug_uart_state_t s_state;

/* GPIO5 and GPIO6 are shared with ICP_CLK and ICP_DAT.  Resetting the GPIO
 * matrix on both pins is essential before another peripheral assumes either
 * signal; changing just the direction can leave a UART route active. */
static esp_err_t release_runtime_uart_pins(void)
{
    const gpio_num_t clock_pin = (gpio_num_t)CONFIG_MS51_CLK_GPIO;
    const gpio_num_t data_pin = (gpio_num_t)CONFIG_MS51_DAT_GPIO;
    esp_err_t error = gpio_reset_pin(clock_pin);
    if (error != ESP_OK) {
        return error;
    }
    error = gpio_set_direction(clock_pin, GPIO_MODE_INPUT);
    if (error != ESP_OK) {
        return error;
    }
    error = gpio_reset_pin(data_pin);
    if (error != ESP_OK) {
        return error;
    }
    return gpio_set_direction(data_pin, GPIO_MODE_INPUT);
}

static uint16_t crc16_update(uint16_t crc, uint8_t value)
{
    crc ^= (uint16_t)value << 8;
    for (unsigned bit_index = 0; bit_index < 8u; ++bit_index) {
        crc = (crc & 0x8000u) != 0u ? (uint16_t)((crc << 1) ^ 0x1021u)
                                     : (uint16_t)(crc << 1);
    }
    return crc;
}

static void reset_partial_line_locked(void)
{
    s_state.line_length = 0;
    s_state.line_overflow = false;
    s_state.line[0] = '\0';
}

static void reset_runtime_parser_locked(void)
{
    s_state.runtime_rx_state = MS51_RUNTIME_RX_WAIT_SOF;
    s_state.runtime_rx_command = 0;
    s_state.runtime_rx_sequence = 0;
    s_state.runtime_rx_status = 0;
    s_state.runtime_rx_length = 0;
    s_state.runtime_rx_index = 0;
    s_state.runtime_rx_crc = 0xFFFFu;
    s_state.runtime_rx_received_crc = 0;
}

static char *trim_text(char *text)
{
    while (*text != '\0' && isspace((unsigned char)*text)) {
        ++text;
    }
    char *end = text + strlen(text);
    while (end > text && isspace((unsigned char)end[-1])) {
        *--end = '\0';
    }
    return text;
}

static bool variable_name_is_valid(const char *name)
{
    if (name == NULL || name[0] == '\0' ||
        strlen(name) >= MS51_DEBUG_VARIABLE_NAME_SIZE) {
        return false;
    }
    for (size_t index = 0; name[index] != '\0'; ++index) {
        const unsigned char value = (unsigned char)name[index];
        if (!isalnum(value) && value != '_' && value != '-' && value != '.' &&
            value != '[' && value != ']') {
            return false;
        }
    }
    return true;
}

static void append_log_locked(const char *text, uint64_t timestamp)
{
    if (text == NULL || text[0] == '\0') {
        return;
    }
    ms51_debug_log_line_t *entry = &s_state.logs[s_state.next_log];
    strlcpy(entry->text, text, sizeof(entry->text));
    entry->received_us = timestamp;
    s_state.next_log = (s_state.next_log + 1u) % MS51_DEBUG_MAX_LOG_LINES;
    if (s_state.log_count < MS51_DEBUG_MAX_LOG_LINES) {
        ++s_state.log_count;
    }
}

static void store_variable_locked(const char *name, const char *value, uint64_t timestamp)
{
    if (!variable_name_is_valid(name) || value == NULL || value[0] == '\0') {
        ++s_state.dropped_lines;
        return;
    }

    size_t selected = MS51_DEBUG_MAX_VARIABLES;
    size_t oldest = 0;
    for (size_t index = 0; index < MS51_DEBUG_MAX_VARIABLES; ++index) {
        if (strcmp(s_state.variables[index].name, name) == 0) {
            selected = index;
            break;
        }
        if (s_state.variables[index].name[0] == '\0' &&
            selected == MS51_DEBUG_MAX_VARIABLES) {
            selected = index;
        }
        if (s_state.variables[index].updated_us < s_state.variables[oldest].updated_us) {
            oldest = index;
        }
    }
    if (selected == MS51_DEBUG_MAX_VARIABLES) {
        selected = oldest;
    }

    ms51_debug_variable_t *entry = &s_state.variables[selected];
    strlcpy(entry->name, name, sizeof(entry->name));
    strlcpy(entry->value, value, sizeof(entry->value));
    entry->updated_us = timestamp;
}

