dangdangduong2k2/esp32c5-ms51-icp/main/ms51_debug_uart.c
static void finish_line_locked(uint64_t timestamp)
{
    if (s_state.line_overflow) {
        ++s_state.dropped_lines;
        reset_partial_line_locked();
        return;
    }
    s_state.line[s_state.line_length] = '\0';
    char *line = trim_text(s_state.line);
    if (line[0] == '\0') {
        reset_partial_line_locked();
        return;
    }

    ++s_state.lines_received;
    if (strncmp(line, "@var,", 5) == 0) {
        char *name = trim_text(line + 5);
        char *separator = strchr(name, ',');
        if (separator == NULL) {
            ++s_state.dropped_lines;
        } else {
            *separator = '\0';
            name = trim_text(name);
            char *value = trim_text(separator + 1);
            store_variable_locked(name, value, timestamp);
        }
    } else if (strncmp(line, "@log,", 5) == 0) {
        append_log_locked(trim_text(line + 5), timestamp);
    } else {
        append_log_locked(line, timestamp);
    }
    reset_partial_line_locked();
}

static void finish_runtime_response_locked(void)
{
    if (s_state.runtime_rx_received_crc != s_state.runtime_rx_crc) {
        ++s_state.dropped_lines;
        return;
    }
    if (!s_state.runtime_waiting ||
        s_state.runtime_rx_command != s_state.runtime_expected_command ||
        s_state.runtime_rx_sequence != s_state.runtime_expected_sequence) {
        return;
    }

    s_state.runtime_response_status = s_state.runtime_rx_status;
    s_state.runtime_response_length = s_state.runtime_rx_length;
    if (s_state.runtime_rx_length != 0u) {
        memcpy(s_state.runtime_response, s_state.runtime_rx_payload,
               s_state.runtime_rx_length);
    }
    s_state.runtime_response_ready = true;
    s_state.runtime_waiting = false;
    xSemaphoreGive(s_state.response_semaphore);
}

/* Returns true when byte belongs to a binary runtime-config response. */
static bool process_runtime_response_byte_locked(uint8_t byte)
{
    switch (s_state.runtime_rx_state) {
    case MS51_RUNTIME_RX_WAIT_SOF:
        if (byte != MS51_RUNTIME_RESPONSE_SOF) {
            return false;
        }
        reset_partial_line_locked();
        s_state.runtime_rx_state = MS51_RUNTIME_RX_COMMAND;
        s_state.runtime_rx_crc = 0xFFFFu;
        return true;

    case MS51_RUNTIME_RX_COMMAND:
        if (byte != MS51_RUNTIME_COMMAND_GET && byte != MS51_RUNTIME_COMMAND_SET) {
            ++s_state.dropped_lines;
            reset_runtime_parser_locked();
            return true;
        }
        s_state.runtime_rx_command = byte;
        s_state.runtime_rx_crc = crc16_update(s_state.runtime_rx_crc, byte);
        s_state.runtime_rx_state = MS51_RUNTIME_RX_SEQUENCE;
        return true;

    case MS51_RUNTIME_RX_SEQUENCE:
        s_state.runtime_rx_sequence = byte;
        s_state.runtime_rx_crc = crc16_update(s_state.runtime_rx_crc, byte);
        s_state.runtime_rx_state = MS51_RUNTIME_RX_STATUS;
        return true;

    case MS51_RUNTIME_RX_STATUS:
        s_state.runtime_rx_status = byte;
        s_state.runtime_rx_crc = crc16_update(s_state.runtime_rx_crc, byte);
        s_state.runtime_rx_state = MS51_RUNTIME_RX_LENGTH;
        return true;

    case MS51_RUNTIME_RX_LENGTH:
        if (byte > MS51_RUNTIME_CONFIG_SIZE) {
            ++s_state.dropped_lines;
            reset_runtime_parser_locked();
            return true;
        }
        s_state.runtime_rx_length = byte;
        s_state.runtime_rx_index = 0;
        s_state.runtime_rx_crc = crc16_update(s_state.runtime_rx_crc, byte);
        s_state.runtime_rx_state = byte == 0u ? MS51_RUNTIME_RX_CRC_HIGH
                                              : MS51_RUNTIME_RX_PAYLOAD;
        return true;

    case MS51_RUNTIME_RX_PAYLOAD:
        s_state.runtime_rx_payload[s_state.runtime_rx_index++] = byte;
        s_state.runtime_rx_crc = crc16_update(s_state.runtime_rx_crc, byte);
        if (s_state.runtime_rx_index >= s_state.runtime_rx_length) {
            s_state.runtime_rx_state = MS51_RUNTIME_RX_CRC_HIGH;
        }
        return true;

    case MS51_RUNTIME_RX_CRC_HIGH:
        s_state.runtime_rx_received_crc = (uint16_t)byte << 8;
        s_state.runtime_rx_state = MS51_RUNTIME_RX_CRC_LOW;
        return true;

    case MS51_RUNTIME_RX_CRC_LOW:
        s_state.runtime_rx_received_crc |= byte;
        finish_runtime_response_locked();
        reset_runtime_parser_locked();
        return true;

    default:
        reset_runtime_parser_locked();
        return true;
    }
}

static void process_byte_locked(uint8_t byte)
{
    ++s_state.bytes_received;
    const uint64_t timestamp = (uint64_t)esp_timer_get_time();
    s_state.last_rx_us = timestamp;

    if (process_runtime_response_byte_locked(byte)) {
        return;
    }
    if (byte == '\n') {
        finish_line_locked(timestamp);
        return;
    }
    if (byte == '\r') {
        return;
    }
    if (byte < 0x20u || byte > 0x7Eu) {
        s_state.line_overflow = true;
        return;
    }
    if (s_state.line_length + 1u >= sizeof(s_state.line)) {
        s_state.line_overflow = true;
        return;
    }
    s_state.line[s_state.line_length++] = (char)byte;
}

static esp_err_t attach_receiver_locked(void)
{
    if (!s_state.enabled || s_state.receiver_attached) {
        return ESP_OK;
    }

    const uart_config_t config = {
        .baud_rate = (int)s_state.baud_rate,
        .data_bits = UART_DATA_8_BITS,
        .parity = UART_PARITY_DISABLE,
        .stop_bits = UART_STOP_BITS_1,
        .flow_ctrl = UART_HW_FLOWCTRL_DISABLE,
        .source_clk = UART_SCLK_DEFAULT,
    };
    bool driver_installed = false;
    esp_err_t error = release_runtime_uart_pins();
    if (error == ESP_OK) {
        error = uart_driver_install(MS51_DEBUG_UART_PORT, MS51_DEBUG_RX_BUFFER_SIZE,
                                    MS51_DEBUG_TX_BUFFER_SIZE, 0, NULL, 0);
        driver_installed = error == ESP_OK;
    }
    if (error == ESP_OK) {
        error = uart_param_config(MS51_DEBUG_UART_PORT, &config);
    }
    if (error == ESP_OK) {
        /* Runtime UART: ESP GPIO5 -> MS51 P0.2 RXD1; MS51 P1.6 TXD1 -> GPIO6. */
        error = uart_set_pin(MS51_DEBUG_UART_PORT, CONFIG_MS51_CLK_GPIO,
                             CONFIG_MS51_DAT_GPIO, UART_PIN_NO_CHANGE,
                             UART_PIN_NO_CHANGE);
    }
    if (error == ESP_OK) {
        error = uart_flush_input(MS51_DEBUG_UART_PORT);
    }
    if (error != ESP_OK) {
        if (driver_installed) {
            uart_driver_delete(MS51_DEBUG_UART_PORT);
        }
        release_runtime_uart_pins();
        return error;
    }

    s_state.receiver_attached = true;
    s_state.paused_for_icp = false;
    reset_partial_line_locked();
    reset_runtime_parser_locked();
    return ESP_OK;
}

static esp_err_t detach_receiver_locked(void)
{
    s_state.paused_for_icp = true;
    reset_partial_line_locked();
    reset_runtime_parser_locked();
    s_state.runtime_waiting = false;
    s_state.runtime_response_ready = false;
    if (!s_state.enabled || !s_state.receiver_attached) {
        return release_runtime_uart_pins();
    }
    esp_err_t error = uart_driver_delete(MS51_DEBUG_UART_PORT);
    if (error == ESP_OK) {
        s_state.receiver_attached = false;
        error = release_runtime_uart_pins();
    }
    return error;
}

static void receiver_task(void *argument)
{
    (void)argument;
    uint8_t buffer[MS51_DEBUG_READ_BUFFER_SIZE];

