dangdangduong2k2/esp32c5-ms51-icp/main/ms51_debug_uart.c
    for (;;) {
        int received = 0;
        xSemaphoreTake(s_state.mutex, portMAX_DELAY);
        if (s_state.receiver_attached) {
            /* Holding the mutex makes uart_driver_delete safe in the ICP handoff. */
            received = uart_read_bytes(MS51_DEBUG_UART_PORT, buffer, sizeof(buffer),
                                       pdMS_TO_TICKS(MS51_DEBUG_READ_WAIT_MS));
            for (int index = 0; index < received; ++index) {
                process_byte_locked(buffer[index]);
            }
        }
        xSemaphoreGive(s_state.mutex);

        if (received <= 0) {
            vTaskDelay(pdMS_TO_TICKS(5));
        }
    }
}

static esp_err_t runtime_config_request(uint8_t command, const uint8_t *payload,
                                        size_t payload_length, uint8_t *result,
                                        uint8_t *target_status)
{
    if (!s_state.initialized || !s_state.enabled || s_state.command_mutex == NULL ||
        s_state.response_semaphore == NULL || target_status == NULL ||
        (payload_length != 0u && payload == NULL)) {
        return ESP_ERR_INVALID_STATE;
    }
    if ((command == MS51_RUNTIME_COMMAND_GET && payload_length != 0u) ||
        (command == MS51_RUNTIME_COMMAND_SET && payload_length != MS51_RUNTIME_CONFIG_SIZE) ||
        (command != MS51_RUNTIME_COMMAND_GET && command != MS51_RUNTIME_COMMAND_SET)) {
        return ESP_ERR_INVALID_ARG;
    }

    if (xSemaphoreTake(s_state.command_mutex,
                       pdMS_TO_TICKS(MS51_RUNTIME_RESPONSE_TIMEOUT_MS)) != pdTRUE) {
        return ESP_ERR_TIMEOUT;
    }

    uint8_t frame[MS51_RUNTIME_REQUEST_MAX_SIZE];
    uint8_t sequence = 0;
    size_t frame_length = 0;
    esp_err_t error = ESP_OK;

    xSemaphoreTake(s_state.mutex, portMAX_DELAY);
    if (!s_state.receiver_attached) {
        error = ESP_ERR_INVALID_STATE;
    } else {
        while (xSemaphoreTake(s_state.response_semaphore, 0) == pdTRUE) {
        }
        sequence = ++s_state.next_runtime_sequence;
        if (sequence == 0u) {
            sequence = ++s_state.next_runtime_sequence;
        }
        s_state.runtime_waiting = true;
        s_state.runtime_expected_command = command;
        s_state.runtime_expected_sequence = sequence;
        s_state.runtime_response_ready = false;
        s_state.runtime_response_length = 0;
        reset_runtime_parser_locked();

        uint16_t crc = 0xFFFFu;
        frame[frame_length++] = MS51_RUNTIME_REQUEST_SOF;
        frame[frame_length++] = command;
        crc = crc16_update(crc, command);
        frame[frame_length++] = sequence;
        crc = crc16_update(crc, sequence);
        frame[frame_length++] = (uint8_t)payload_length;
        crc = crc16_update(crc, (uint8_t)payload_length);
        for (size_t index = 0; index < payload_length; ++index) {
            frame[frame_length++] = payload[index];
            crc = crc16_update(crc, payload[index]);
        }
        frame[frame_length++] = (uint8_t)(crc >> 8);
        frame[frame_length++] = (uint8_t)crc;

        const int written = uart_write_bytes(MS51_DEBUG_UART_PORT, (const char *)frame,
                                             frame_length);
        if (written < 0 || (size_t)written != frame_length) {
            s_state.runtime_waiting = false;
            error = ESP_FAIL;
        }
    }
    xSemaphoreGive(s_state.mutex);

    if (error == ESP_OK &&
        uart_wait_tx_done(MS51_DEBUG_UART_PORT,
                          pdMS_TO_TICKS(MS51_RUNTIME_RESPONSE_TIMEOUT_MS)) != ESP_OK) {
        error = ESP_ERR_TIMEOUT;
    }
    if (error == ESP_OK &&
        xSemaphoreTake(s_state.response_semaphore,
                       pdMS_TO_TICKS(MS51_RUNTIME_RESPONSE_TIMEOUT_MS)) != pdTRUE) {
        error = ESP_ERR_TIMEOUT;
    }

    xSemaphoreTake(s_state.mutex, portMAX_DELAY);
    if (error == ESP_OK) {
        if (!s_state.runtime_response_ready) {
            error = ESP_ERR_INVALID_RESPONSE;
        } else {
            *target_status = s_state.runtime_response_status;
            if (s_state.runtime_response_status == MS51_RUNTIME_CONFIG_STATUS_OK &&
                command == MS51_RUNTIME_COMMAND_GET) {
                if (s_state.runtime_response_length != MS51_RUNTIME_CONFIG_SIZE ||
                    result == NULL) {
                    error = ESP_ERR_INVALID_RESPONSE;
                } else {
                    memcpy(result, s_state.runtime_response, MS51_RUNTIME_CONFIG_SIZE);
                }
            } else if (s_state.runtime_response_length != 0u) {
                error = ESP_ERR_INVALID_RESPONSE;
            }
        }
    }
    s_state.runtime_waiting = false;
    s_state.runtime_response_ready = false;
    xSemaphoreGive(s_state.mutex);
    xSemaphoreGive(s_state.command_mutex);
    return error;
}

esp_err_t ms51_debug_uart_init(void)
{
    if (s_state.initialized) {
        return ESP_OK;
    }

    s_state.mutex = xSemaphoreCreateMutex();
    s_state.command_mutex = xSemaphoreCreateMutex();
    s_state.response_semaphore = xSemaphoreCreateBinary();
    if (s_state.mutex == NULL || s_state.command_mutex == NULL ||
        s_state.response_semaphore == NULL) {
        if (s_state.mutex != NULL) {
            vSemaphoreDelete(s_state.mutex);
        }
        if (s_state.command_mutex != NULL) {
            vSemaphoreDelete(s_state.command_mutex);
        }
        if (s_state.response_semaphore != NULL) {
            vSemaphoreDelete(s_state.response_semaphore);
        }
        memset(&s_state, 0, sizeof(s_state));
        return ESP_ERR_NO_MEM;
    }
    s_state.enabled = MS51_DEBUG_UART_ENABLED;
    s_state.baud_rate = MS51_DEBUG_UART_BAUD_RATE;
    s_state.initialized = true;

    xSemaphoreTake(s_state.mutex, portMAX_DELAY);
    const esp_err_t attach_error = attach_receiver_locked();
    xSemaphoreGive(s_state.mutex);
    if (attach_error != ESP_OK) {
        s_state.initialized = false;
        vSemaphoreDelete(s_state.response_semaphore);
        vSemaphoreDelete(s_state.command_mutex);
        vSemaphoreDelete(s_state.mutex);
        memset(&s_state, 0, sizeof(s_state));
        return attach_error;
    }

    if (s_state.enabled &&
        xTaskCreate(receiver_task, "ms51_debug", MS51_DEBUG_TASK_STACK_SIZE, NULL,
                    MS51_DEBUG_TASK_PRIORITY, &s_state.task) != pdPASS) {
        xSemaphoreTake(s_state.mutex, portMAX_DELAY);
        detach_receiver_locked();
        xSemaphoreGive(s_state.mutex);
        s_state.initialized = false;
        vSemaphoreDelete(s_state.response_semaphore);
        vSemaphoreDelete(s_state.command_mutex);
        vSemaphoreDelete(s_state.mutex);
        memset(&s_state, 0, sizeof(s_state));
        return ESP_ERR_NO_MEM;
    }

