dangdangduong2k2/esp32c5-ms51-icp/main/ms51_debug_uart.c
    ESP_LOGI(TAG, "%s: GPIO%d TX -> MS51 P0.2, GPIO%d RX <- MS51 P1.6 at %u baud",
             s_state.enabled ? "runtime UART enabled" : "runtime UART disabled",
             CONFIG_MS51_CLK_GPIO, CONFIG_MS51_DAT_GPIO, (unsigned)s_state.baud_rate);
    return ESP_OK;
}

esp_err_t ms51_debug_uart_pause_for_icp(void)
{
    if (!s_state.initialized || !s_state.enabled) {
        return release_runtime_uart_pins();
    }
    xSemaphoreTake(s_state.command_mutex, portMAX_DELAY);
    xSemaphoreTake(s_state.mutex, portMAX_DELAY);
    const esp_err_t error = detach_receiver_locked();
    xSemaphoreGive(s_state.mutex);
    xSemaphoreGive(s_state.command_mutex);
    if (error != ESP_OK) {
        ESP_LOGE(TAG, "could not release GPIO%d/GPIO%d for ICP: %s",
                 CONFIG_MS51_CLK_GPIO, CONFIG_MS51_DAT_GPIO, esp_err_to_name(error));
    }
    return error;
}

esp_err_t ms51_debug_uart_resume_after_icp(void)
{
    if (!s_state.initialized || !s_state.enabled) {
        return ESP_OK;
    }
    xSemaphoreTake(s_state.command_mutex, portMAX_DELAY);
    xSemaphoreTake(s_state.mutex, portMAX_DELAY);
    const esp_err_t error = attach_receiver_locked();
    xSemaphoreGive(s_state.mutex);
    xSemaphoreGive(s_state.command_mutex);
    if (error != ESP_OK) {
        ESP_LOGE(TAG, "could not restore UART on GPIO%d/GPIO%d after ICP: %s",
                 CONFIG_MS51_CLK_GPIO, CONFIG_MS51_DAT_GPIO, esp_err_to_name(error));
    }
    return error;
}

esp_err_t ms51_debug_uart_get_snapshot(ms51_debug_uart_snapshot_t *snapshot)
{
    if (snapshot == NULL || !s_state.initialized || s_state.mutex == NULL) {
        return ESP_ERR_INVALID_ARG;
    }

    memset(snapshot, 0, sizeof(*snapshot));
    xSemaphoreTake(s_state.mutex, portMAX_DELAY);
    snapshot->enabled = s_state.enabled;
    snapshot->receiver_attached = s_state.receiver_attached;
    snapshot->paused_for_icp = s_state.paused_for_icp;
    snapshot->baud_rate = s_state.baud_rate;
    snapshot->bytes_received = s_state.bytes_received;
    snapshot->lines_received = s_state.lines_received;
    snapshot->dropped_lines = s_state.dropped_lines;
    snapshot->last_rx_us = s_state.last_rx_us;

    for (size_t index = 0; index < MS51_DEBUG_MAX_VARIABLES; ++index) {
        if (s_state.variables[index].name[0] != '\0') {
            snapshot->variables[snapshot->variable_count++] = s_state.variables[index];
        }
    }
    const size_t first_log = (s_state.next_log + MS51_DEBUG_MAX_LOG_LINES -
                              s_state.log_count) %
                             MS51_DEBUG_MAX_LOG_LINES;
    for (size_t index = 0; index < s_state.log_count; ++index) {
        snapshot->logs[index] =
            s_state.logs[(first_log + index) % MS51_DEBUG_MAX_LOG_LINES];
    }
    snapshot->log_count = s_state.log_count;
    xSemaphoreGive(s_state.mutex);
    return ESP_OK;
}

esp_err_t ms51_debug_uart_get_runtime_config(uint8_t config[MS51_RUNTIME_CONFIG_SIZE],
                                             uint8_t *target_status)
{
    if (config == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    return runtime_config_request(MS51_RUNTIME_COMMAND_GET, NULL, 0, config,
                                  target_status);
}

esp_err_t ms51_debug_uart_set_runtime_config(
    const uint8_t config[MS51_RUNTIME_CONFIG_SIZE], uint8_t *target_status)
{
    if (config == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    return runtime_config_request(MS51_RUNTIME_COMMAND_SET, config,
                                  MS51_RUNTIME_CONFIG_SIZE, NULL, target_status);
}
